#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_policy.test-policy: Refreshing state... [id=arn:aws:iam::881752951086:policy/test-policy]
aws_iam_role.demo: Refreshing state... [id=eks-cluster-demo]
aws_vpc.main: Refreshing state... [id=vpc-0859106471ca3a3b8]
aws_eip.nat: Refreshing state... [id=eipalloc-03a608929afe7b101]
aws_iam_role.nodes: Refreshing state... [id=eks-node-group-nodes]
aws_iam_policy.eks_cluster_autoscaler: Refreshing state... [id=arn:aws:iam::881752951086:policy/eks-cluster-autoscaler]
aws_iam_role_policy_attachment.demo-AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-demo-20240728211039334000000001]
aws_iam_role_policy_attachment.nodes-AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-nodes-20240728211039437300000004]
aws_iam_role_policy_attachment.nodes-AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-nodes-20240728211039386700000002]
aws_iam_role_policy_attachment.nodes-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-nodes-20240728211039409200000003]
aws_internet_gateway.igw: Refreshing state... [id=igw-0b73b9612a8996377]
aws_subnet.private-a: Refreshing state... [id=subnet-02ef7359515bd80b2]
aws_subnet.private-b: Refreshing state... [id=subnet-06ea1e310188a5e62]
aws_subnet.public-b: Refreshing state... [id=subnet-0b7c18c2eda3b2391]
aws_subnet.public-a: Refreshing state... [id=subnet-0b00e80b0a85fe1d2]
aws_nat_gateway.nat: Refreshing state... [id=nat-0ed4fd0ae6211dd64]
aws_eks_cluster.demo: Refreshing state... [id=demo]
aws_eks_node_group.private-nodes: Refreshing state... [id=demo:private-nodes]
data.tls_certificate.eks: Reading...
data.tls_certificate.eks: Read complete after 1s [id=0fec78e2228057fe710f52c784cacb6ef0a852b4]
aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::881752951086:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/7327508F107072136569AB18D5237D73]
data.aws_iam_policy_document.test_oidc_assume_role_policy: Reading...
data.aws_iam_policy_document.eks_cluster_autoscaler_assume_role_policy: Reading...
data.aws_iam_policy_document.eks_cluster_autoscaler_assume_role_policy: Read complete after 0s [id=2592728678]
data.aws_iam_policy_document.test_oidc_assume_role_policy: Read complete after 0s [id=1320951073]
aws_iam_role.eks_cluster_autoscaler: Refreshing state... [id=eks-cluster-autoscaler]
aws_iam_role.test_oidc: Refreshing state... [id=test-oidc]
aws_iam_role_policy_attachment.test_attach: Refreshing state... [id=test-oidc-20240728211857009100000007]
aws_iam_role_policy_attachment.eks_cluster_autoscaler_attach: Refreshing state... [id=eks-cluster-autoscaler-20240728211857205000000008]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_eks_node_group.private-nodes is tainted, so must be replaced
-/+ resource "aws_eks_node_group" "private-nodes" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:eu-central-1:881752951086:nodegroup/demo/private-nodes/bac87d9a-f8ae-549d-e80a-11c949a14208" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "demo:private-nodes" -> (known after apply)
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.30.0-20240703" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-private-nodes-bac87d9a-f8ae-549d-e80a-11c949a14208"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ version                = "1.30" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + cluster_name               = (sensitive value)
  - eks_cluster_autoscaler_arn = "arn:aws:iam::881752951086:role/eks-cluster-autoscaler" -> null
  - test_policy_arn            = "arn:aws:iam::881752951086:role/test-oidc" -> null

```

</details>

*Pusher: @pavelnikolov, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Terraform Plan`*